In [1]:
import pandas as pd
from sqlalchemy import create_engine
from pandas_profiling import ProfileReport
from pandasgui import show
import dtale
import numpy as np

In [2]:
engine = create_engine('mysql+pymysql://root:123456@localhost:3306/stockdata')
#转成十进制显示，不成功
#pd.set_option('display.float_format', '{:.2g}'.format)
#pd.Series(data=[0.00000001])
pd.set_option('display.float_format', lambda x: '%.3f' % x)

# 看市场的水位，通过时间区间的涨跌幅度，观察时间区间的强势、收益情况
# 逻辑是全量交易数据，200w，先设置显示的行数
# 设置开始和结束时间，算涨跌幅，对比响应的指数

In [3]:

sql_trade_daily = "SELECT * FROM stockdata.stocktradedailyinfo;"
df_read1 = pd.read_sql_query(sql_trade_daily, engine)
sql_stock_info = "select ts_code,name from stockinfobase"
df_read2 = pd.read_sql_query(sql_stock_info, engine)

In [4]:
df_read1.dtypes

id                    object
ts_code               object
amount               float64
echange              float64
close                float64
high                 float64
low                  float64
open                 float64
pct_chg              float64
pre_close            float64
trade_date    datetime64[ns]
vol                  float64
dtype: object

In [5]:
df_read1.set_index("trade_date",inplace=True)

In [6]:
#df_read1[20].shift(periods=1,freq=30)

In [7]:
df_read1.index

DatetimeIndex(['2020-02-24', '2020-02-24', '2020-02-24', '2020-02-24',
               '2020-02-24', '2020-02-24', '2020-02-24', '2020-02-24',
               '2020-02-24', '2020-02-24',
               ...
               '2021-08-23', '2021-08-23', '2021-08-23', '2021-08-23',
               '2021-08-23', '2021-08-23', '2021-08-23', '2021-08-23',
               '2021-08-23', '2021-08-23'],
              dtype='datetime64[ns]', name='trade_date', length=2032866, freq=None)

In [8]:
def pairStockCloseMinus(x):
    if(len(x.close)<2):
        return pd.Series([x.ts_code,None])
    else:
        return pd.Series([x.ts_code[0], (x.close[1] - x.close[0]) / x.close[0]])

In [9]:
cut = df_read1.query("trade_date==20210823 or trade_date==20220221").groupby(["ts_code"]).apply(pairStockCloseMinus)

In [10]:
cut

                                                           0      1
ts_code
000001.SZ                                          000001.SZ -0.145
000002.SZ                                          000002.SZ -0.093
000004.SZ                                          000004.SZ  0.111
000005.SZ                                          000005.SZ  0.081
000006.SZ                                          000006.SZ -0.013
...                                                      ...    ...
871396.BJ  trade_date
2022-02-21    871396.BJ
Name: ts_co...    NaN
871553.BJ  trade_date
2022-02-21    871553.BJ
Name: ts_co...    NaN
871642.BJ  trade_date
2022-02-21    871642.BJ
Name: ts_co...    NaN
871981.BJ  trade_date
2022-02-21    871981.BJ
Name: ts_co...    NaN
872925.BJ  trade_date
2022-02-21    872925.BJ
Name: ts_co...    NaN

[4725 rows x 2 columns]

In [11]:
cut.columns

RangeIndex(start=0, stop=2, step=1)

In [12]:
cut.reset_index(drop=True, inplace=True)

In [13]:
#cut.columns=["stock_code","interval_ATR%"]

In [14]:
cut.columns=["ts_code","interval_ATR%"]

In [15]:
cut['ts_code'] = cut['ts_code'].str[:6]

In [16]:
cut.columns

Index(['ts_code', 'interval_ATR%'], dtype='object')

In [17]:
cut

                                                ts_code  interval_ATR%
0                                                000001         -0.145
1                                                000002         -0.093
2                                                000004          0.111
3                                                000005          0.081
4                                                000006         -0.013
...                                                 ...            ...
4720  trade_date
2022-02-21    871396.BJ
Name: ts_co...            NaN
4721  trade_date
2022-02-21    871553.BJ
Name: ts_co...            NaN
4722  trade_date
2022-02-21    871642.BJ
Name: ts_co...            NaN
4723  trade_date
2022-02-21    871981.BJ
Name: ts_co...            NaN
4724  trade_date
2022-02-21    872925.BJ
Name: ts_co...            NaN

[4725 rows x 2 columns]

In [18]:
df_read2

     ts_code     name
0     000001     平安银行
1     000002      万科A
2     000004     国华网安
3     000005     ST星源
4     000006     深振业A
...      ...      ...
4688  871553     凯腾精工
4689  871642     通易航天
4690  871981     晶赛科技
4691  872925     锦好医疗
4692  689009  九号公司-WD

[4693 rows x 2 columns]

In [19]:
type(cut)

pandas.core.frame.DataFrame

In [20]:
cut.dtypes

ts_code           object
interval_ATR%    float64
dtype: object

In [21]:
df_read2.dtypes

ts_code    object
name       object
dtype: object

In [22]:
df_read2.index

RangeIndex(start=0, stop=4693, step=1)

In [23]:
cut.index

RangeIndex(start=0, stop=4725, step=1)

In [24]:
df_read2['ts_code']=df_read2['ts_code'].astype(str)

In [25]:
cut['ts_code']=cut['ts_code'].astype(str)

In [26]:
df_read2

     ts_code     name
0     000001     平安银行
1     000002      万科A
2     000004     国华网安
3     000005     ST星源
4     000006     深振业A
...      ...      ...
4688  871553     凯腾精工
4689  871642     通易航天
4690  871981     晶赛科技
4691  872925     锦好医疗
4692  689009  九号公司-WD

[4693 rows x 2 columns]

In [27]:
cut

                                                ts_code  interval_ATR%
0                                                000001         -0.145
1                                                000002         -0.093
2                                                000004          0.111
3                                                000005          0.081
4                                                000006         -0.013
...                                                 ...            ...
4720  trade_date\n2022-02-21    871396.BJ\nName: ts_...            NaN
4721  trade_date\n2022-02-21    871553.BJ\nName: ts_...            NaN
4722  trade_date\n2022-02-21    871642.BJ\nName: ts_...            NaN
4723  trade_date\n2022-02-21    871981.BJ\nName: ts_...            NaN
4724  trade_date\n2022-02-21    872925.BJ\nName: ts_...            NaN

[4725 rows x 2 columns]

In [28]:
cut_modify=cut.merge(df_read2,left_on="ts_code",right_on="ts_code",how="inner")

show(cut_modify)

In [29]:
dtale.show(cut_modify)

Exception occurred while processing request: invalid syntax (<unknown>, line 1)
Traceback (most recent call last):
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 114, in _handle_exceptions
    return func(*args, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 1787, in test_filter
    run_query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\query.py", line 69, in run_query
    df = df.query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4060, in query
    res = self.eval(expr, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4191, in eval
    return _eval(expr, inplace=inplace, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\eval.py", line 348, in eval
    parsed_expr = Expr(expr, engine=engine, parser=parser, env=env)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 806, in __init__
    self.terms = self.parse()
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 825, in parse
    return self._visitor.visit(self.expr)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 407, in visit
    raise e
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 403, in visit
    node = ast.fix_missing_locations(ast.parse(clean))
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\ast.py", line 50, in parse
    return compile(source, filename, mode, flags,
  File "<unknown>", line 1
    interval_ATR %>0.2
                  ^
SyntaxError: invalid syntax

2022-03-19 10:27:27,821 - ERROR    - Exception occurred while processing request: invalid syntax (<unknown>, line 1)
Traceback (most recent call last):
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 114, in _handle_exceptions
    return func(*args, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 1787, in test_filter
    run_query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\query.py", line 69, in run_query
    df = df.query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4060, in query
    res = self.eval(expr, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4191, in eval
    return _eval(expr, inplace=inplace, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\eval.py", line 348, in eval
    parsed_expr = Expr(expr, engine=engine, parser=parser, env=env)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 806, in __init__
    self.terms = self.parse()
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 825, in parse
    return self._visitor.visit(self.expr)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 407, in visit
    raise e
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 403, in visit
    node = ast.fix_missing_locations(ast.parse(clean))
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\ast.py", line 50, in parse
    return compile(source, filename, mode, flags,
  File "<unknown>", line 1
    interval_ATR %>0.2
                  ^
SyntaxError: invalid syntax

Exception occurred while processing request: 'UnaryOp' object has no attribute 'type'
Traceback (most recent call last):
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 114, in _handle_exceptions
    return func(*args, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 1787, in test_filter
    run_query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\query.py", line 69, in run_query
    df = df.query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4060, in query
    res = self.eval(expr, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4191, in eval
    return _eval(expr, inplace=inplace, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\eval.py", line 348, in eval
    parsed_expr = Expr(expr, engine=engine, parser=parser, env=env)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 806, in __init__
    self.terms = self.parse()
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 825, in parse
    return self._visitor.visit(self.expr)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 411, in visit
    return visitor(node, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 417, in visit_Module
    return self.visit(expr, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 411, in visit
    return visitor(node, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 420, in visit_Expr
    return self.visit(node.value, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 411, in visit
    return visitor(node, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 534, in visit_BinOp
    return self._maybe_evaluate_binop(op, op_class, left, right)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 506, in _maybe_evaluate_binop
    f"'{lhs.type}' and '{rhs.type}'"
AttributeError: 'UnaryOp' object has no attribute 'type'

2022-03-19 10:28:49,855 - ERROR    - Exception occurred while processing request: 'UnaryOp' object has no attribute 'type'
Traceback (most recent call last):
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 114, in _handle_exceptions
    return func(*args, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\views.py", line 1787, in test_filter
    run_query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\dtale\query.py", line 69, in run_query
    df = df.query(
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4060, in query
    res = self.eval(expr, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\frame.py", line 4191, in eval
    return _eval(expr, inplace=inplace, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\eval.py", line 348, in eval
    parsed_expr = Expr(expr, engine=engine, parser=parser, env=env)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 806, in __init__
    self.terms = self.parse()
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 825, in parse
    return self._visitor.visit(self.expr)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 411, in visit
    return visitor(node, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 417, in visit_Module
    return self.visit(expr, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 411, in visit
    return visitor(node, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 420, in visit_Expr
    return self.visit(node.value, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 411, in visit
    return visitor(node, **kwargs)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 534, in visit_BinOp
    return self._maybe_evaluate_binop(op, op_class, left, right)
  File "d:\ProgramData\Anaconda3\envs\pytorch3.9\lib\site-packages\pandas\core\computation\expr.py", line 506, in _maybe_evaluate_binop
    f"'{lhs.type}' and '{rhs.type}'"
AttributeError: 'UnaryOp' object has no attribute 'type'

In [33]:
show(cut_modify)

PandasGUI INFO — pandasgui.gui — Opening PandasGUI
2022-02-23 01:02:25,808 - INFO     - Opening PandasGUI

In [30]:
cut = df_read1.query("trade_date==20211109 or trade_date==20211111").groupby(["ts_code"]).apply(pairStockCloseMinus)

In [31]:
cut

                   0      1
ts_code
000001.SZ  000001.SZ  0.047
000002.SZ  000002.SZ  0.141
000004.SZ  000004.SZ -0.013
000005.SZ  000005.SZ -0.005
000006.SZ  000006.SZ  0.046
...              ...    ...
688799.SH  688799.SH  0.033
688800.SH  688800.SH  0.074
688819.SH  688819.SH -0.014
688981.SH  688981.SH -0.001
689009.SH  689009.SH  0.012

[4528 rows x 2 columns]

In [32]:
dtale.show(cut)

In [ ]:
type(cut)

def applyfunc(y):
    for x in y.tolist():
        print(x.name+":   "+x)
rand = np.random.RandomState(1)
df = pd.DataFrame({'A': ['foo', 'bar'] * 3,
                   'B': rand.randn(6),
                   'C': rand.randint(0, 20, 6)})
gb = df.groupby(['A'])
df

df_read1.query("trade_date==20211109 or trade_date==20211111")

In [ ]:
df_read1.query("trade_date==20211109 or trade_date==20211111").groupby(["ts_code"]).apply(lambda x:print(x.ts_code[0],(x.close[1]-x.close[0])/x.close[0]))

In [ ]:
close1=df_read1["2022-01-05"].groupby(["ts_code"]).get_group("600203.SH")['close']

In [ ]:
df_read1["2021-21-11"]

In [ ]:
close2=df_read1["2022-01-07"][['ts_code','close']]
print(close2.to_string())

In [ ]:
dd11=df_read1["2022-01-05":"2022-01-08"].groupby(["ts_code"])['close'].apply(applyfunc)

In [ ]:
df_read1

In [ ]:
df_read1["2022-01-04":"2022-01-05"].groupby(['ts_code'])["close"].transform(lambda x: x-x)

In [ ]:
# >>> df = pd.DataFrame({'A': a, 'B': b}, index=[0])
# >>> df
#    A  B
# 0  2  3

# >>> df = pd.DataFrame({'A': [a], 'B': [b]})
# >>> df
#    A  B
# 0  2  3

In [ ]:
df_test = pd.DataFrame(
    {
        "group": [11,22],
        #"date1": pd.to_datetime("2020-01-02","2020-01-03")
        "date1": pd.Series(["2020-01-02","2020-01-03"],dtype='datetime64[ns]')

    }
)
df_test

In [ ]:
df_test[[(df_test['date1']==pd.to_datetime("2020-01-02"))]]

In [ ]:
df_test['date1']==pd.to_datetime("2020-01-02")